'use strict';

const FAQ = `Давным-давно человечество решилось на невероятный шаг — выйти за пределы Солнечной системы. Космические корабли бороздили бескрайние просторы, изучая далёкие миры и открывая загадки вселенной. Однако покой на границе космоса — лишь иллюзия, потому что пространство, которое кажется пустым и спокойным, таит в себе скрытые опасности.

Вы пилот небольшого корабля, которому поручено одно из самых сложных и опасных заданий: прорываться через зону астероидов, непрерывно движущихся навстречу. Их становится всё больше и они окружают вас так плотно, что в какой-то момент кажется, что шансов на выживание уже нет. Но вы — не из тех, кто сдаётся. С каждой попыткой вы накапливаете опыт, улучшаете огневую мощь и усиливаете щиты чтобы выстоять под натиском каменных гигантов.

Ваша цель - продержаться как можно дольше в этом беспощадном космосе. Помните: здесь нет конца, только постоянная борьба. Сколько вам удастся выстоять перед лицом неизбежного?

.....

За каждый разбитый астероид вы получите очки. За маленький — 1 очко, за средний — 3, а уничтожение большого принесёт 10 очков.

Когда астероид пропадает из зоны видимости, то распадается на множество осколков. Чем прочнее астероид, тем больше новых появится из его останков. В отличии от остальных, ледяные астероиды исчезают бесследно.

Каждый тип астероидов появляется только по достижении определённого уровня опасности, который отображается в верхнем левом углу экрана.

Горячие клавиши: "F" чтобы включить или выключить показ FPS, "P" чтобы поставить игру на паузу.`;